posts/english.org
#+TITLE: Grammar
#+SETUPFILE: https://blog.bugswriter.com/static/theme.setup

* Noun
Person, Place, things and idea

* Singular and Plural Noun
- Singular ----> Single
- Plural ------> Plus, More

* Irregular Plural -f  => -ve
| Singular | Plural |
|----------+--------|
| leaf     | leaves |
| calf     | calves |

* Irregular Plural (-en)
child->children
brother->brotheren
ox->oxen
* Irregular Plural Noun (base Plural)
sheep, fish , bison

* Common (general) and Proper (specific) Nouns
| Common   | Proper  |
|----------+---------|
| City     | Chicago |
| River    | Nile    |
| Mountain | Everast |

* Concrete and Abstract Nouns
Concrete : together grown (PHYSICAL)
Abstract : away drawn (NON PHYSICAL)

* Irregular Plural Noun (Mutant Plurals)
Seven words Only
| Singular | Plural |
|----------+--------|
| foot     | feet   |
| Woman    | Women  |
| Man      | Men    |
| tooth    | teeth  |
| goose    | geese  |
| mouse    | mice   |
| louse    | lice   |

* Irregular Plural Nouns (Foreign Plurals)
| Language | change  | Singular  | Irr. Plural | Reg. Plural |
|----------+---------+-----------+-------------+-------------|
| Latin    | a->ae   | larva     | larvae      | larvas      |
| Latin    | us->i   | fungus    | fungi       | funguses    |
| Latin    | um->a   | datum     | data        | ---------   |
| Latin    | ex-ices | index     | indices     | indexes     |
| Greek    | is-es   | thesis    | theses      | thesises    |
| Greek    | on->a   | criterion | criteria    | ----------  |

* Vowel Harmony
The first vowel sound like second vowel in germanic language
foot -> footi -> feet

* Verb
Show Action
Link Concept
Auxilary/Helping Verb

* Introduction to Agreement [ ]
- [ ] The Dog Barks
- [ ] The Dogs Bark
- [X] The Dog Bark
- [X] The Dogs Barks

* Introduction to Varb Tense
Past Present Future

* The Present Tense (Right Now)
I eat a Donut (right now)
Louise doesn't want a catapult (right now)
The Water is Super Cold (right now)
Bertie is Singing in the shower (right now)

