posts/english.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-21 Wed 22:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Grammar</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="AkashRaj" />
<link rel="stylesheet" type="text/css" href="https://blog.bugswriter.com/static/style.css"/>


</head>
<body>
<div id="content">
<h1 class="title">Grammar</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5865d5e">1. Noun</a></li>
<li><a href="#org299a97c">2. Singular and Plural Noun</a></li>
<li><a href="#org8c646bc">3. Irregular Plural -f  =&gt; -ve</a></li>
<li><a href="#org39cbefa">4. Irregular Plural (-en)</a></li>
<li><a href="#org640a664">5. Irregular Plural Noun (base Plural)</a></li>
<li><a href="#org2f9d89d">6. Common (general) and Proper (specific) Nouns</a></li>
<li><a href="#org8cda7a6">7. Concrete and Abstract Nouns</a></li>
<li><a href="#org8f5dc51">8. Irregular Plural Noun (Mutant Plurals)</a></li>
<li><a href="#org16f688c">9. Irregular Plural Nouns (Foreign Plurals)</a></li>
<li><a href="#org50d9444">10. Vowel Harmony</a></li>
<li><a href="#org4316591">11. Verb</a></li>
<li><a href="#org06f586e">12. Introduction to Agreement [ ]</a></li>
<li><a href="#orgb8e471d">13. Introduction to Varb Tense</a></li>
<li><a href="#org3415a5f">14. The Present Tense (Right Now)</a></li>
<li><a href="#orga9a1195">15. The Past Tense</a></li>
<li><a href="#org37da53b">16. The Future Tense</a></li>
<li><a href="#orgc6c2e71">17. The Helping Verb</a></li>
<li><a href="#orgdba333c">18. Linking Verb</a></li>
<li><a href="#org37952b9">19. Introduction to Irregular Verbs</a></li>
<li><a href="#org5792066">20. Irregular verbs ( the funky -ed )</a></li>
<li><a href="#org3c7b60d">21. Vowel Shift</a></li>
<li><a href="#orgf32a898">22. Irregular Verbs ( Taken for a ride )</a></li>
<li><a href="#org8e11a53">23. The Truly Irregular Verbs</a></li>
<li><a href="#orgd3b7790">24. Introduction to Verb Aspect</a></li>
<li><a href="#orgdb7d18a">25. Simple Aspect</a></li>
<li><a href="#orge961842">26. progressive Aspect</a></li>
<li><a href="#org315f591">27. Prefect Aspect</a></li>
<li><a href="#org083b510">28. Perfect Progressive Aspect</a></li>
<li><a href="#org1749994">29. Pronoun</a></li>
<li><a href="#orgb72bf24">30. Personal Pronoun</a></li>
<li><a href="#org32553dd">31. Possesive Pronoun</a></li>
<li><a href="#org1c6cf49">32. Reflexive Pronoun</a></li>
<li><a href="#orgdacfabe">33. Relative Pronoun</a></li>
<li><a href="#org184c58e">34. that vs which</a></li>
<li><a href="#orgc7eb68c">35. who vs whom</a></li>
<li><a href="#org27a5e67">36. Subject and Object Pronoun</a></li>
<li><a href="#org7b26bc3">37. Grammatical person and pronoun</a></li>
<li><a href="#orgcdef01c">38. Pronoun Number</a></li>
<li><a href="#org1eb636a">39. Intro to the Comparative &amp; Superlative</a></li>
<li><a href="#org711e2a1">40. How to form comparitive and superlative</a></li>
<li><a href="#org8171550">41. Table</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5865d5e" class="outline-2">
<h2 id="org5865d5e"><span class="section-number-2">1</span> Noun</h2>
<div class="outline-text-2" id="text-1">
<p>
Person, Place, things and idea
</p>
</div>
</div>

<div id="outline-container-org299a97c" class="outline-2">
<h2 id="org299a97c"><span class="section-number-2">2</span> Singular and Plural Noun</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Singular -&#x2014;&gt; Single</li>
<li>Plural -&#x2013;&#x2014;&gt; Plus, More</li>
</ul>
</div>
</div>

<div id="outline-container-org8c646bc" class="outline-2">
<h2 id="org8c646bc"><span class="section-number-2">3</span> Irregular Plural -f  =&gt; -ve</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Singular</th>
<th scope="col" class="org-left">Plural</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">leaf</td>
<td class="org-left">leaves</td>
</tr>

<tr>
<td class="org-left">calf</td>
<td class="org-left">calves</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org39cbefa" class="outline-2">
<h2 id="org39cbefa"><span class="section-number-2">4</span> Irregular Plural (-en)</h2>
<div class="outline-text-2" id="text-4">
<p>
child-&gt;children
brother-&gt;brotheren
ox-&gt;oxen
</p>
</div>
</div>
<div id="outline-container-org640a664" class="outline-2">
<h2 id="org640a664"><span class="section-number-2">5</span> Irregular Plural Noun (base Plural)</h2>
<div class="outline-text-2" id="text-5">
<p>
sheep, fish , bison
</p>
</div>
</div>

<div id="outline-container-org2f9d89d" class="outline-2">
<h2 id="org2f9d89d"><span class="section-number-2">6</span> Common (general) and Proper (specific) Nouns</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Common</th>
<th scope="col" class="org-left">Proper</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">City</td>
<td class="org-left">Chicago</td>
</tr>

<tr>
<td class="org-left">River</td>
<td class="org-left">Nile</td>
</tr>

<tr>
<td class="org-left">Mountain</td>
<td class="org-left">Everast</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8cda7a6" class="outline-2">
<h2 id="org8cda7a6"><span class="section-number-2">7</span> Concrete and Abstract Nouns</h2>
<div class="outline-text-2" id="text-7">
<p>
Concrete : together grown (PHYSICAL)
Abstract : away drawn (NON PHYSICAL)
</p>
</div>
</div>

<div id="outline-container-org8f5dc51" class="outline-2">
<h2 id="org8f5dc51"><span class="section-number-2">8</span> Irregular Plural Noun (Mutant Plurals)</h2>
<div class="outline-text-2" id="text-8">
<p>
Seven words Only
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Singular</th>
<th scope="col" class="org-left">Plural</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">foot</td>
<td class="org-left">feet</td>
</tr>

<tr>
<td class="org-left">Woman</td>
<td class="org-left">Women</td>
</tr>

<tr>
<td class="org-left">Man</td>
<td class="org-left">Men</td>
</tr>

<tr>
<td class="org-left">tooth</td>
<td class="org-left">teeth</td>
</tr>

<tr>
<td class="org-left">goose</td>
<td class="org-left">geese</td>
</tr>

<tr>
<td class="org-left">mouse</td>
<td class="org-left">mice</td>
</tr>

<tr>
<td class="org-left">louse</td>
<td class="org-left">lice</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org16f688c" class="outline-2">
<h2 id="org16f688c"><span class="section-number-2">9</span> Irregular Plural Nouns (Foreign Plurals)</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Language</th>
<th scope="col" class="org-left">change</th>
<th scope="col" class="org-left">Singular</th>
<th scope="col" class="org-left">Irr. Plural</th>
<th scope="col" class="org-left">Reg. Plural</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Latin</td>
<td class="org-left">a-&gt;ae</td>
<td class="org-left">larva</td>
<td class="org-left">larvae</td>
<td class="org-left">larvas</td>
</tr>

<tr>
<td class="org-left">Latin</td>
<td class="org-left">us-&gt;i</td>
<td class="org-left">fungus</td>
<td class="org-left">fungi</td>
<td class="org-left">funguses</td>
</tr>

<tr>
<td class="org-left">Latin</td>
<td class="org-left">um-&gt;a</td>
<td class="org-left">datum</td>
<td class="org-left">data</td>
<td class="org-left">---------</td>
</tr>

<tr>
<td class="org-left">Latin</td>
<td class="org-left">ex-ices</td>
<td class="org-left">index</td>
<td class="org-left">indices</td>
<td class="org-left">indexes</td>
</tr>

<tr>
<td class="org-left">Greek</td>
<td class="org-left">is-es</td>
<td class="org-left">thesis</td>
<td class="org-left">theses</td>
<td class="org-left">thesises</td>
</tr>

<tr>
<td class="org-left">Greek</td>
<td class="org-left">on-&gt;a</td>
<td class="org-left">criterion</td>
<td class="org-left">criteria</td>
<td class="org-left">----------</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org50d9444" class="outline-2">
<h2 id="org50d9444"><span class="section-number-2">10</span> Vowel Harmony</h2>
<div class="outline-text-2" id="text-10">
<p>
The first vowel sound like second vowel in germanic language
foot -&gt; footi -&gt; feet
</p>
</div>
</div>

<div id="outline-container-org4316591" class="outline-2">
<h2 id="org4316591"><span class="section-number-2">11</span> Verb</h2>
<div class="outline-text-2" id="text-11">
<p>
Show Action
Link Concept
Auxilary/Helping Verb
</p>
</div>
</div>

<div id="outline-container-org06f586e" class="outline-2">
<h2 id="org06f586e"><span class="section-number-2">12</span> Introduction to Agreement [ ]</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> The Dog Barks</li>
<li class="off"><code>[&#xa0;]</code> The Dogs Bark</li>
<li class="on"><code>[X]</code> The Dog Bark</li>
<li class="on"><code>[X]</code> The Dogs Barks</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8e471d" class="outline-2">
<h2 id="orgb8e471d"><span class="section-number-2">13</span> Introduction to Varb Tense</h2>
<div class="outline-text-2" id="text-13">
<p>
Past Present Future
</p>
</div>
</div>

<div id="outline-container-org3415a5f" class="outline-2">
<h2 id="org3415a5f"><span class="section-number-2">14</span> The Present Tense (Right Now)</h2>
<div class="outline-text-2" id="text-14">
<p>
I eat a Donut (right now)
Louise doesn&rsquo;t want a catapult (right now)
The Water is Super Cold (right now)
Bertie is Singing in the shower (right now)
</p>
</div>
</div>
