posts/english.tex
% Created 2020-11-19 Thu 14:25
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{John Doe}
\date{\today}
\title{Grammar}
\hypersetup{
 pdfauthor={John Doe},
 pdftitle={Grammar},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Noun}
\label{sec:org469f81b}
Person, Place, things and idea

\section{Singular and Plural Noun}
\label{sec:org8f25742}
\begin{itemize}
\item Singular ----> Single
\item Plural ------> Plus, More
\end{itemize}

\section{Irregular Plural -f  => -ve}
\label{sec:org899e6b2}
\begin{center}
\begin{tabular}{ll}
Singular & Plural\\
\hline
leaf & leaves\\
calf & calves\\
\end{tabular}
\end{center}

\section{Irregular Plural (-en)}
\label{sec:orga9d12f8}
child->children
brother->brotheren
ox->oxen
\section{Irregular Plural Noun (base Plural)}
\label{sec:org2b892e6}
sheep, fish , bison

\section{Common (general) and Proper (specific) Nouns}
\label{sec:orgdf5b941}
\begin{center}
\begin{tabular}{ll}
Common & Proper\\
\hline
City & Chicago\\
River & Nile\\
Mountain & Everast\\
\end{tabular}
\end{center}

\section{Concrete and Abstract Nouns}
\label{sec:org3e76baa}
Concrete : together grown (PHYSICAL)
Abstract : away drawn (NON PHYSICAL)

\section{Irregular Plural Noun (Mutant Plurals)}
\label{sec:org69bf592}
Seven words Only
\begin{center}
\begin{tabular}{ll}
Singular & Plural\\
\hline
foot & feet\\
Woman & Women\\
Man & Men\\
tooth & teeth\\
goose & geese\\
mouse & mice\\
louse & lice\\
\end{tabular}
\end{center}

\section{Irregular Plural Nouns (Foreign Plurals)}
\label{sec:org0feb113}
\begin{center}
\begin{tabular}{lllll}
Language & change & Singular & Irr. Plural & Reg. Plural\\
\hline
Latin & a->ae & larva & larvae & larvas\\
Latin & us->i & fungus & fungi & funguses\\
Latin & um->a & datum & data & ---------\\
Latin & ex-ices & index & indices & indexes\\
Greek & is-es & thesis & theses & thesises\\
Greek & on->a & criterion & criteria & ----------\\
\end{tabular}
\end{center}

\section{Vowel Harmony}
\label{sec:org2546ba2}
The first vowel sound like second vowel in germanic language
foot -> footi -> feet

\section{Verb}
\label{sec:orgc824365}
Show Action
Link Concept
Auxilary/Helping Verb

\section{Introduction to Agreement [ ]}
\label{sec:orgdad3ba4}
\begin{itemize}
\item[{$\square$}] The Dog Barks
\item[{$\square$}] The Dogs Bark
\item[{$\boxtimes$}] The Dog Bark
\item[{$\boxtimes$}] The Dogs Barks
\end{itemize}

\section{Introduction to Varb Tense}
\label{sec:orgfedf1af}
Past Present Future

\section{The Present Tense (Right Now)}
\label{sec:org128e5f2}
I eat a Donut (right now)
Louise doesn't want a catapult (right now)
The Water is Super Cold (right now)
Bertie is Singing in the shower (right now)
