posts/english.org
* The Past Tense
I walkes to the moon

* The Future Tense
Before Verb insert Will in present tense.
will, is going to

* The Helping Verb
To have, To be

* Linking Verb
| Action ( Does)          | State of being Verbs ( is ) |
|-------------------------+-----------------------------|
| The bear *eats* a fish  | The bear *is* hungry        |
| The bear *looked* at me | The bear *looked* lonely    |


* Introduction to Irregular Verbs
ran, run, will run
| verb | 1st Present | 3rd Present Sg. | Plural Present | 1st Past | Plural Past |
|------+-------------+-----------------+----------------+----------+-------------|
| be   | i am        | she is          | we are         | i was    | we were     |
| have | i have      | she has         | we have        | i had    | we had      |
| do   | i do        | she does        | we do          | i did    | we did      |
| say  | i say       | she says        | we say         | i said   | we said     |

* Irregular verbs ( the funky -ed )
    | past   | present | past  | present |
    |--------+---------+-------+---------|
    | walked | walk    | spent | spend   |
    | slept  | sleep   | left  | leave   |
    | kept   | keep    | leapt | leap    |
    | built  | build   | lost  | lose    |

* Vowel Shift
| presenbt | past  | past perfect |
|----------+-------+--------------|
| sing     | sang  | sung         |
| win      | won   | won          |
| find     | found | found        |
| sit      | sat   | sat          |
| sneak    | snuck | snuck        |
| run      | ran   | run          |

* Irregular Verbs ( Taken for a ride )

*  The Truly Irregular Verbs
| change          | present            | past                     |
|-----------------+--------------------+--------------------------|
| -ught           | teach catch bring  | taught caught brought    |
| -d + U shift    | flee say           | fled said                |
| past=present    | bet set hurt       | bet set hurt             |
| model auxillary | can may shell will | could might should would |

* Introduction to Verb Aspect
<---------------|-------------------|--------------------|------------------>
              then                  now                 later
              i walked              i walk               i will walk

 - i have walked
 - i have been walking

* Simple Aspect
i walked              i walk           i will walk

* progressive Aspect
i was walking            i am walking    i will be walking

ABCs : Always BE ConjugatING

* Prefect Aspect
it allows us to travel back in time little extra
| i had washed the dishes | i have washed the dishes | i will have washed the dishes |

* Perfect Progressive Aspect
               *have* + been + varbing
| i had benn eating cookies | i have been eating cookies \ |
* Pronoun
* Personal Pronoun
-me -you -third
