posts/english.html

<div id="outline-container-orga9a1195" class="outline-2">
<h2 id="orga9a1195"><span class="section-number-2">15</span> The Past Tense</h2>
<div class="outline-text-2" id="text-15">
<p>
I walkes to the moon
</p>
</div>
</div>

<div id="outline-container-org37da53b" class="outline-2">
<h2 id="org37da53b"><span class="section-number-2">16</span> The Future Tense</h2>
<div class="outline-text-2" id="text-16">
<p>
Before Verb insert Will in present tense.
will, is going to
</p>
</div>
</div>

<div id="outline-container-orgc6c2e71" class="outline-2">
<h2 id="orgc6c2e71"><span class="section-number-2">17</span> The Helping Verb</h2>
<div class="outline-text-2" id="text-17">
<p>
To have, To be
</p>
</div>
</div>

<div id="outline-container-orgdba333c" class="outline-2">
<h2 id="orgdba333c"><span class="section-number-2">18</span> Linking Verb</h2>
<div class="outline-text-2" id="text-18">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Action ( Does)</th>
<th scope="col" class="org-left">State of being Verbs ( is )</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">The bear <b>eats</b> a fish</td>
<td class="org-left">The bear <b>is</b> hungry</td>
</tr>

<tr>
<td class="org-left">The bear <b>looked</b> at me</td>
<td class="org-left">The bear <b>looked</b> lonely</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org37952b9" class="outline-2">
<h2 id="org37952b9"><span class="section-number-2">19</span> Introduction to Irregular Verbs</h2>
<div class="outline-text-2" id="text-19">
<p>
ran, run, will run
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">verb</th>
<th scope="col" class="org-left">1st Present</th>
<th scope="col" class="org-left">3rd Present Sg.</th>
<th scope="col" class="org-left">Plural Present</th>
<th scope="col" class="org-left">1st Past</th>
<th scope="col" class="org-left">Plural Past</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">be</td>
<td class="org-left">i am</td>
<td class="org-left">she is</td>
<td class="org-left">we are</td>
<td class="org-left">i was</td>
<td class="org-left">we were</td>
</tr>

<tr>
<td class="org-left">have</td>
<td class="org-left">i have</td>
<td class="org-left">she has</td>
<td class="org-left">we have</td>
<td class="org-left">i had</td>
<td class="org-left">we had</td>
</tr>

<tr>
<td class="org-left">do</td>
<td class="org-left">i do</td>
<td class="org-left">she does</td>
<td class="org-left">we do</td>
<td class="org-left">i did</td>
<td class="org-left">we did</td>
</tr>

<tr>
<td class="org-left">say</td>
<td class="org-left">i say</td>
<td class="org-left">she says</td>
<td class="org-left">we say</td>
<td class="org-left">i said</td>
<td class="org-left">we said</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5792066" class="outline-2">
<h2 id="org5792066"><span class="section-number-2">20</span> Irregular verbs ( the funky -ed )</h2>
<div class="outline-text-2" id="text-20">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">past</th>
<th scope="col" class="org-left">present</th>
<th scope="col" class="org-left">past</th>
<th scope="col" class="org-left">present</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">walked</td>
<td class="org-left">walk</td>
<td class="org-left">spent</td>
<td class="org-left">spend</td>
</tr>

<tr>
<td class="org-left">slept</td>
<td class="org-left">sleep</td>
<td class="org-left">left</td>
<td class="org-left">leave</td>
</tr>

<tr>
<td class="org-left">kept</td>
<td class="org-left">keep</td>
<td class="org-left">leapt</td>
<td class="org-left">leap</td>
</tr>

<tr>
<td class="org-left">built</td>
<td class="org-left">build</td>
<td class="org-left">lost</td>
<td class="org-left">lose</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3c7b60d" class="outline-2">
<h2 id="org3c7b60d"><span class="section-number-2">21</span> Vowel Shift</h2>
<div class="outline-text-2" id="text-21">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">presenbt</th>
<th scope="col" class="org-left">past</th>
<th scope="col" class="org-left">past perfect</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">sing</td>
<td class="org-left">sang</td>
<td class="org-left">sung</td>
</tr>

<tr>
<td class="org-left">win</td>
<td class="org-left">won</td>
<td class="org-left">won</td>
</tr>

<tr>
<td class="org-left">find</td>
<td class="org-left">found</td>
<td class="org-left">found</td>
</tr>

<tr>
<td class="org-left">sit</td>
<td class="org-left">sat</td>
<td class="org-left">sat</td>
</tr>

<tr>
<td class="org-left">sneak</td>
<td class="org-left">snuck</td>
<td class="org-left">snuck</td>
</tr>

<tr>
<td class="org-left">run</td>
<td class="org-left">ran</td>
<td class="org-left">run</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf32a898" class="outline-2">
<h2 id="orgf32a898"><span class="section-number-2">22</span> Irregular Verbs ( Taken for a ride )</h2>
</div>

<div id="outline-container-org8e11a53" class="outline-2">
<h2 id="org8e11a53"><span class="section-number-2">23</span> The Truly Irregular Verbs</h2>
<div class="outline-text-2" id="text-23">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">change</th>
<th scope="col" class="org-left">present</th>
<th scope="col" class="org-left">past</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">-ught</td>
<td class="org-left">teach catch bring</td>
<td class="org-left">taught caught brought</td>
</tr>

<tr>
<td class="org-left">-d + U shift</td>
<td class="org-left">flee say</td>
<td class="org-left">fled said</td>
</tr>

<tr>
<td class="org-left">past=present</td>
<td class="org-left">bet set hurt</td>
<td class="org-left">bet set hurt</td>
</tr>

<tr>
<td class="org-left">model auxillary</td>
<td class="org-left">can may shell will</td>
<td class="org-left">could might should would</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd3b7790" class="outline-2">
<h2 id="orgd3b7790"><span class="section-number-2">24</span> Introduction to Verb Aspect</h2>
<div class="outline-text-2" id="text-24">
<p>
&lt;----------&#x2013;&#x2014;|--------------&#x2013;&#x2014;|---------------&#x2013;&#x2014;|-------------&#x2013;&#x2014;&gt;
              then                  now                 later
              i walked              i walk               i will walk
</p>

<ul class="org-ul">
<li>i have walked</li>
<li>i have been walking</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb7d18a" class="outline-2">
<h2 id="orgdb7d18a"><span class="section-number-2">25</span> Simple Aspect</h2>
<div class="outline-text-2" id="text-25">
<p>
i walked              i walk           i will walk
</p>
</div>
</div>

<div id="outline-container-orge961842" class="outline-2">
<h2 id="orge961842"><span class="section-number-2">26</span> progressive Aspect</h2>
<div class="outline-text-2" id="text-26">
<p>
i was walking            i am walking    i will be walking
</p>

<p>
ABCs : Always BE ConjugatING
</p>
</div>
</div>

<div id="outline-container-org315f591" class="outline-2">
<h2 id="org315f591"><span class="section-number-2">27</span> Prefect Aspect</h2>
<div class="outline-text-2" id="text-27">
<p>
it allows us to travel back in time little extra
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">i had washed the dishes</td>
<td class="org-left">i have washed the dishes</td>
<td class="org-left">i will have washed the dishes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org083b510" class="outline-2">
<h2 id="org083b510"><span class="section-number-2">28</span> Perfect Progressive Aspect</h2>
<div class="outline-text-2" id="text-28">
<p>
<b>have</b> + been + varbing
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">i had benn eating cookies</td>
<td class="org-left">i have been eating cookies \</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org1749994" class="outline-2">
<h2 id="org1749994"><span class="section-number-2">29</span> Pronoun</h2>
</div>
<div id="outline-container-orgb72bf24" class="outline-2">
<h2 id="orgb72bf24"><span class="section-number-2">30</span> Personal Pronoun</h2>
<div class="outline-text-2" id="text-30">
<p>
-me -you -third
</p>
</div>
</div>
