posts/english.tex

\section{The Past Tense}
\label{sec:orgdb0ccf1}
I walkes to the moon

\section{The Future Tense}
\label{sec:org1ef1dbf}
Before Verb insert Will in present tense.
will, is going to

\section{The Helping Verb}
\label{sec:org5fb59a7}
To have, To be

\section{Linking Verb}
\label{sec:org25347e8}
\begin{center}
\begin{tabular}{ll}
Action ( Does) & State of being Verbs ( is )\\
\hline
The bear \textbf{eats} a fish & The bear \textbf{is} hungry\\
The bear \textbf{looked} at me & The bear \textbf{looked} lonely\\
\end{tabular}
\end{center}


\section{Introduction to Irregular Verbs}
\label{sec:org11894c5}
ran, run, will run
\begin{center}
\begin{tabular}{llllll}
verb & 1st Present & 3rd Present Sg. & Plural Present & 1st Past & Plural Past\\
\hline
be & i am & she is & we are & i was & we were\\
have & i have & she has & we have & i had & we had\\
do & i do & she does & we do & i did & we did\\
say & i say & she says & we say & i said & we said\\
\end{tabular}
\end{center}

\section{Irregular verbs ( the funky -ed )}
\label{sec:org6ba3134}
\begin{center}
\begin{tabular}{llll}
past & present & past & present\\
\hline
walked & walk & spent & spend\\
slept & sleep & left & leave\\
kept & keep & leapt & leap\\
built & build & lost & lose\\
\end{tabular}
\end{center}

\section{Vowel Shift}
\label{sec:org3ee2c72}
\begin{center}
\begin{tabular}{lll}
presenbt & past & past perfect\\
\hline
sing & sang & sung\\
win & won & won\\
find & found & found\\
sit & sat & sat\\
sneak & snuck & snuck\\
run & ran & run\\
\end{tabular}
\end{center}

\section{Irregular Verbs ( Taken for a ride )}
\label{sec:org5415ce5}

\section{The Truly Irregular Verbs}
\label{sec:orgaeca165}
\begin{center}
\begin{tabular}{lll}
change & present & past\\
\hline
-ught & teach catch bring & taught caught brought\\
-d + U shift & flee say & fled said\\
past=present & bet set hurt & bet set hurt\\
model auxillary & can may shell will & could might should would\\
\end{tabular}
\end{center}

\section{Introduction to Verb Aspect}
\label{sec:org21b570e}
<---------------|-------------------|--------------------|------------------>
              then                  now                 later
              i walked              i walk               i will walk

\begin{itemize}
\item i have walked
\item i have been walking
\end{itemize}

\section{Simple Aspect}
\label{sec:orgf22e1d0}
i walked              i walk           i will walk

\section{progressive Aspect}
\label{sec:org3aa20a7}
i was walking            i am walking    i will be walking

ABCs : Always BE ConjugatING

\section{Prefect Aspect}
\label{sec:org42a47ec}
it allows us to travel back in time little extra
\begin{center}
\begin{tabular}{lll}
i had washed the dishes & i have washed the dishes & i will have washed the dishes\\
\end{tabular}
\end{center}

\section{Perfect Progressive Aspect}
\label{sec:orgcff44fa}
\textbf{have} + been + varbing
\begin{center}
\begin{tabular}{ll}
i had benn eating cookies & i have been eating cookies $\backslash$\\
\end{tabular}
\end{center}
\section{Pronoun}
\label{sec:org13ef4ed}
\section{Personal Pronoun}
\label{sec:org9ed59fb}
-me -you -third
