posts/english.org
* Possesive Pronoun
possesion = having stuff
Adjective = my, our, your, her, his, its, their
Noun = Mine, ours, yours, hers, his ,its , theirss
* Reflexive Pronoun
myself, ourself, yourself, yourselves, itself, herself, himself, themselves
they all are doees(done to) except yourself
* Relative Pronoun
- link independent clause with independent clause
* that vs which
- that is used with everything, which is not good with people 9/10 not used, used with ','
* who vs whom
- who -----> sub, obj
- whom -----> obj
* Subject and Object Pronoun
- Subject -----> he , she, they , I
- Object  -----> him, her, them, me
- you, it are far away from this shit
* Grammatical person and pronoun
Stay in you lane
* Pronoun Number
you and they execpt in sing and plu.

* Intro to the Comparative & Superlative
- happy, happier, happiest
  comparative = more
  superlative = most
* How to form comparitive and superlative





* Table
| I                  | II                 | III               |
|--------------------+--------------------+-------------------|
| Noun               | footi--fetti OM    | Funky-ed          |
| S&P Noun           | Verb               | VowelShift        |
| -en irr.           | Intro. Agreement   | taken for...      |
| base               | Intro verb tense   | Truly Irr.        |
| -f ve              | Present RN         | Verb Aspect       |
| Common,Specific    | Past               | simple            |
| Concrete, Abstract | Future has will    | ABCs              |
| MutantPlural       | Helping Verb  (HV) | have + walked     |
| ForeignPlural      | Linking Verb       | have+been+verbing |
| Grammar            | Irr.Verb be,has,do | Modal Verb        |

- HV : inflicated form of to have, to be ( is, has, was, had beeen ) :::::::: Linking Verb "is" State of being verb
-
