posts/english.html
<div id="outline-container-org32553dd" class="outline-2">
<h2 id="org32553dd"><span class="section-number-2">31</span> Possesive Pronoun</h2>
<div class="outline-text-2" id="text-31">
<p>
possesion = having stuff
Adjective = my, our, your, her, his, its, their
Noun = Mine, ours, yours, hers, his ,its , theirss
</p>
</div>
</div>
<div id="outline-container-org1c6cf49" class="outline-2">
<h2 id="org1c6cf49"><span class="section-number-2">32</span> Reflexive Pronoun</h2>
<div class="outline-text-2" id="text-32">
<p>
myself, ourself, yourself, yourselves, itself, herself, himself, themselves
they all are doees(done to) except yourself
</p>
</div>
</div>
<div id="outline-container-orgdacfabe" class="outline-2">
<h2 id="orgdacfabe"><span class="section-number-2">33</span> Relative Pronoun</h2>
<div class="outline-text-2" id="text-33">
<ul class="org-ul">
<li>link independent clause with independent clause</li>
</ul>
</div>
</div>
<div id="outline-container-org184c58e" class="outline-2">
<h2 id="org184c58e"><span class="section-number-2">34</span> that vs which</h2>
<div class="outline-text-2" id="text-34">
<ul class="org-ul">
<li>that is used with everything, which is not good with people 9/10 not used, used with &rsquo;,&rsquo;</li>
</ul>
</div>
</div>
<div id="outline-container-orgc7eb68c" class="outline-2">
<h2 id="orgc7eb68c"><span class="section-number-2">35</span> who vs whom</h2>
<div class="outline-text-2" id="text-35">
<ul class="org-ul">
<li>who &#x2013;&#x2014;&gt; sub, obj</li>
<li>whom &#x2013;&#x2014;&gt; obj</li>
</ul>
</div>
</div>
<div id="outline-container-org27a5e67" class="outline-2">
<h2 id="org27a5e67"><span class="section-number-2">36</span> Subject and Object Pronoun</h2>
<div class="outline-text-2" id="text-36">
<ul class="org-ul">
<li>Subject &#x2013;&#x2014;&gt; he , she, they , I</li>
<li>Object  &#x2013;&#x2014;&gt; him, her, them, me</li>
<li>you, it are far away from this shit</li>
</ul>
</div>
</div>
<div id="outline-container-org7b26bc3" class="outline-2">
<h2 id="org7b26bc3"><span class="section-number-2">37</span> Grammatical person and pronoun</h2>
<div class="outline-text-2" id="text-37">
<p>
Stay in you lane
</p>
</div>
</div>
<div id="outline-container-orgcdef01c" class="outline-2">
<h2 id="orgcdef01c"><span class="section-number-2">38</span> Pronoun Number</h2>
<div class="outline-text-2" id="text-38">
<p>
you and they execpt in sing and plu.
</p>
</div>
</div>

<div id="outline-container-org1eb636a" class="outline-2">
<h2 id="org1eb636a"><span class="section-number-2">39</span> Intro to the Comparative &amp; Superlative</h2>
<div class="outline-text-2" id="text-39">
<ul class="org-ul">
<li>happy, happier, happiest
comparative = more
superlative = most</li>
</ul>
</div>
</div>
<div id="outline-container-org711e2a1" class="outline-2">
<h2 id="org711e2a1"><span class="section-number-2">40</span> How to form comparitive and superlative</h2>
</div>





<div id="outline-container-org8171550" class="outline-2">
<h2 id="org8171550"><span class="section-number-2">41</span> Table</h2>
<div class="outline-text-2" id="text-41">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">I</th>
<th scope="col" class="org-left">II</th>
<th scope="col" class="org-left">III</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Noun</td>
<td class="org-left">footi&#x2013;fetti OM</td>
<td class="org-left">Funky-ed</td>
</tr>

<tr>
<td class="org-left">S&amp;P Noun</td>
<td class="org-left">Verb</td>
<td class="org-left">VowelShift</td>
</tr>

<tr>
<td class="org-left">-en irr.</td>
<td class="org-left">Intro. Agreement</td>
<td class="org-left">taken for&#x2026;</td>
</tr>

<tr>
<td class="org-left">base</td>
<td class="org-left">Intro verb tense</td>
<td class="org-left">Truly Irr.</td>
</tr>

<tr>
<td class="org-left">-f ve</td>
<td class="org-left">Present RN</td>
<td class="org-left">Verb Aspect</td>
</tr>

<tr>
<td class="org-left">Common,Specific</td>
<td class="org-left">Past</td>
<td class="org-left">simple</td>
</tr>

<tr>
<td class="org-left">Concrete, Abstract</td>
<td class="org-left">Future has will</td>
<td class="org-left">ABCs</td>
</tr>

<tr>
<td class="org-left">MutantPlural</td>
<td class="org-left">Helping Verb  (HV)</td>
<td class="org-left">have + walked</td>
</tr>

<tr>
<td class="org-left">ForeignPlural</td>
<td class="org-left">Linking Verb</td>
<td class="org-left">have+been+verbing</td>
</tr>

<tr>
<td class="org-left">Grammar</td>
<td class="org-left">Irr.Verb be,has,do</td>
<td class="org-left">Modal Verb</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>HV : inflicated form of to have, to be ( is, has, was, had beeen ) :::::::: Linking Verb &ldquo;is&rdquo; State of being verb</li>
<li></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: AkashRaj</p>
<p class="date">Created: 2021-07-21 Wed 22:45</p>
</div>
</body>
</html>
