posts/english.tex
\section{Possesive Pronoun}
\label{sec:org43fc989}
possesion = having stuff
Adjective = my, our, your, her, his, its, their
Noun = Mine, ours, yours, hers, his ,its , theirss
\section{Reflexive Pronoun}
\label{sec:org088152e}
myself, ourself, yourself, yourselves, itself, herself, himself, themselves
they all are doees(done to) except yourself
\section{Relative Pronoun}
\label{sec:org0c3b441}
\begin{itemize}
\item link independent clause with independent clause
\end{itemize}
\section{that vs which}
\label{sec:orge1236f0}
\begin{itemize}
\item that is used with everything, which is not good with people 9/10 not used, used with ','
\end{itemize}
\section{who vs whom}
\label{sec:org3938206}
\begin{itemize}
\item who -----> sub, obj
\item whom -----> obj
\end{itemize}
\section{Subject and Object Pronoun}
\label{sec:org0ea632d}
\begin{itemize}
\item Subject -----> he , she, they , I
\item Object  -----> him, her, them, me
\item you, it are far away from this shit
\end{itemize}
\section{Grammatical person and pronoun}
\label{sec:org0e894f8}
Stay in you lane
\section{Pronoun Number}
\label{sec:orgfe80556}
you and they execpt in sing and plu.

\section{Intro to the Comparative \& Superlative}
\label{sec:org0a19bc1}
\begin{itemize}
\item happy, happier, happiest
comparative = more
superlative = most
\end{itemize}
\section{How to form comparitive and superlative}
\label{sec:orgc2d9e62}
\end{document}
